# DegreeFInterval Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..DegreeFInterval Property
SymbolTypeId Class See Also
---
Symbol °F, indicating unit Fahrenheit interval.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId DegreeFInterval { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DegreeFInterval As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ DegreeFInterval {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace